# ******************************************************************************
# Book        : 最短コースでわかる PyTorch ＆深層学習プログラミング
# Chapter     : 2 Pytorchの基本機能
# Theme       : 3 自動微分
# Creat Date  : 2022/1/30
# Final Update:
# URL         : https://github.com/makaishi2/pytorch_book_info
# Page        : P76 - P79
# ******************************************************************************


# ＜概要＞
# - Pytorchの中心的な機能といえる自動微分機能のフローを確認する
#   --- 詳細は2-4で確認


# ＜フロー＞
# 1 勾配計算用の変数の定義
# 2 テンソル変数間で計算
# 3 計算グラフの可視化
# 4 勾配計算
# 5 勾配値の取得
# 6 勾配値の初期化